---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.GutterType
source: html/1d687654-ed9e-e502-9bb4-a62914760890.htm
---
# GutterType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.